/*
*********************************************************************************************************
*
*	模块名称 : GPIO引脚外部中断模块
*	文件名称 : bsp_exti.h
*	版    本 : V5.1
*	说    明 : 
*
*	Copyright (C), 2015-2020, 阿波罗科技 www.apollorobot.cn
*
*********************************************************************************************************
*/
#ifndef __EXTI_H
#define	__EXTI_H

#include "stm32f10x.h"


void bsp_InitEXTI(void);

#endif /* __EXTI_H */
/***************************** 阿波罗科技 www.apollorobot.cn (END OF FILE) *********************************/
